# GetFillPattern Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPatternElement..::..GetFillPattern Method
FillPatternElement Class See Also
---
Gets the FillPattern associated to this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FillPattern GetFillPattern()
```

Visual Basic
---
```text
Public Function GetFillPattern As FillPattern
```

Visual C++
---
```text
public:
FillPattern^ GetFillPattern()
```

# ### Return Value
A copy of FillPattern object.
# See Also
FillPatternElement Class
Autodesk.Revit.DB Namespace